# -*- coding: utf-8 -*-


class TengwarDescription(object):

    consonansts = [
        u"т", u"п", u"-", u"к",
        u"д", u"б", u"-", u"ґ",
        u"ц", u"-", u"ч", u"-",
        u"-", u"-", u"дж", u"-",
        u"с", u"ф", u"ш", u"г",
        u"з", u"в", u"ж", u"х",
        u"н", u"м", u"-", u"-",
        u"-", u"-", u"й", u"-",
        u"р", u"-", u"л", u"-",
    ]

    vowels = [
        u"а", u"е", u"i", u"о", u"у", u"и"
    ]

    palatalization = [
        u"я", u"є", u"ї", u"ьо", u"ю", u"ь", u"’"
    ]


charset = u"а б в г ґ д е є ж з и i ї й к л м н о п р с т у ф х ц ч ш щ ь ю я ’"


transcription_map = [
    (u"а", u"a"),
    (u"б", u"b"),
    (u"в", u"v"),
    (u"г", u"h"),
    (u"ґ", u"g"),
    (u"д", u"d"),
    (u"е", u"e"),
    (u"є", u"je"),
    (u"ж", u"ž"),
    (u"з", u"z"),
    (u"и", u"y"),
    (u"i", u"i"),
    (u"ї", u"ji"),
    (u"й", u"j"),
    (u"к", u"k"),
    (u"л", u"l"),
    (u"м", u"m"),
    (u"н", u"n"),
    (u"о", u"o"),
    (u"п", u"p"),
    (u"р", u"r"),
    (u"с", u"s"),
    (u"т", u"t"),
    (u"у", u"u"),
    (u"ф", u"f"),
    (u"х", u"x"),
    (u"ц", u"c"),
    (u"ч", u"č"),
    (u"ш", u"š"),
    (u"щ", u"šč"),
    (u"ь", u"´"),
    (u"ю", u"ju"),
    (u"я", u"ja"),
    (u"'", u"’"),

    (u"dž", u"ʤ"),
]
